phase-1/13-tls-overhead/measurements/autocannon_http.log
Running 30s test @ http://localhost:8080/
100 connections


┌─────────┬──────┬────────┬────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5% │ 50%    │ 97.5%  │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼──────┼────────┼────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 5 ms │ 114 ms │ 776 ms │ 1017 ms │ 182.72 ms │ 210.08 ms │ 2496 ms │
└─────────┴──────┴────────┴────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬───────┬───────┬─────────┬────────┬────────┬─────────┬───────┐
│ Stat      │ 1%    │ 2.5%  │ 50%     │ 97.5%  │ Avg    │ Stdev   │ Min   │
├───────────┼───────┼───────┼─────────┼────────┼────────┼─────────┼───────┤
│ Req/Sec   │ 151   │ 151   │ 423     │ 1,094  │ 520.6  │ 280.07  │ 151   │
├───────────┼───────┼───────┼─────────┼────────┼────────┼─────────┼───────┤
│ Bytes/Sec │ 29 kB │ 29 kB │ 81.3 kB │ 210 kB │ 100 kB │ 53.8 kB │ 29 kB │
└───────────┴───────┴───────┴─────────┴────────┴────────┴─────────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 30

17k requests in 30.04s, 3 MB read